[
  {
    "title": "I Crush My Students' Dreams Because Mine Never Came True",
    "long_title": "I Crush My Students' Dreams Because Mine Never Came True",
    "story": "I know people will hate me for this, which is why this is a throwaway account. I don't really care what others think anyway. I'm just here to get this off my chest. I wasn't always a high school teacher. I was going to be a singer, maybe even an actress. I had it all—youth, beauty, a degree in liberal arts, and I was the girl all the guys wanted. I wasn't just popular; I was admired. My life was supposed to be a series of sold-out shows, and glamorous parties. But life didn't turn out that way. Instead, I ended up in a classroom with a bunch of snotty teenagers. Young and full of hope and dreams... ugh, it's nauseating. Every year, there's always a few who think they're gonna make it big in music, or be famous on social media. They're so naive, thinking they'll be the next big thing, as if the world is just waiting to discover them. It's pathetic, really. I could've been something special, but life isn't fair. It took me years to accept that. But now, when I see these kids, I can't help but bring them down to reality. I mean, who do they think they are? Do they really believe they're going to make it in a world that chewed me up and spit me out? I used to tell them to \"follow their dreams\" like everyone else, but I got tired of seeing them get hurt when those dreams crashed and burned. So I decided to save them the heartache. When a student tells me they want to be a musician or a dancer, I make sure they understand how hard it is, how few people actually make it. I drop little comments here and there— \"You know, it's a tough industry\", \"Maybe you should have a backup plan\", \"It's really competitive, and not everyone's cut out for it.\" I can see the doubt start to creep in, and honestly, it feels good. I'm not being mean, I'm just giving them a dose of reality. They think they're so special, but they're not. No one is. They need to know that, sooner or later. I'm doing them a favor, really. It's better they learn now than spend years chasing something that'll never happen. And if they lose a little enthusiasm along the way, well, that's life. I know people will say I'm bitter, jealous, whatever but they don't know what it's like to have everything and end up with nothing. So yeah, I watch their dreams die, but at least I'm preparing them for the real world. So go ahead, judge me if you want."
  },
  {
    "title": "AITA for telling my boyfriend, that I will wear a head scarf, when he grows his foreskin back?",
    "long_title": "Am i the asshole for telling my boyfriend, that I will wear a head scarf, when he grows his foreskin back?",
    "story": "Throwaway account for privacy reasons. My (24 F) boyfriend (28 M) is a Muslim. He usually is not very traditional. We don't live in a Muslim country.The other day he told me, that as soon as we get engaged, I will need to wear a headscarf to cover my hair. I am very proud of my long wavy hair and a headscarf is absolutely out of the question and he knows that.When we first met, he even told me, that he doesn't like that tradition and that his girlfriend will never have to wear one.Now yesterday we had a real fight about it. His parents want us to get engaged and engagement means the future bride has to cover her hair.It got a heated argument and I ended it with: \"I will wear the damn thing, as soon as you grow your foreskin back!\" He left without saying a word and went to his parents place. Silence since then. Am i the asshole?"
  },
  {
    "title": "I still think about my best friends' girlfriend",
    "long_title": "I still think about my best friends' girlfriend",
    "story": "I'm a 26-year old man. In February 2020, I was in a deeply loving relationship with a stunningly beautiful girl, one of the most famous girls in our college. She significantly elevated my social status, making me very popular. Though I wasn't average-looking, being with someone so desired by everyone was different. One day, my best friend and I went on a double date with our girlfriends. His girlfriend seemed a bit different to me; her subtle advances were only noticeable to me. The way she stared at me was irresistible. After that hangout, I couldn't get her out of my mind. Despite being in love with my girlfriend, I was drawn to this other girl like a magnet. That day, she called and asked to meet. We met at a cozy cafe owned by one of her close friends. She taught me how to smoke a cigarette and then started kissing me, pushing the smoke from her mouth into mine. Her seductive behavior was overwhelming. Unable to resist, I ended up having the most incredible sex of my life with her in the storeroom of that cafe. Although my girlfriend and I had frequent sex, this experience was entirely different. A week later, I discovered she had broken up with my best friend and left the city without telling him. I tried calling her multiple times, but her phone was always off. My friend eventually moved on, especially as the Covid lockdown hit soon after. It's been five years, and I still can't get it off my chest. I not only cheated on my girlfriend but also betrayed my best friend. What bothers me most is that when I think about her, I feel like I would do it all over again."
  },
  {
    "title": "I've been in love with him for years, but today I found out he's getting married.",
    "long_title": "I've been in love with him for years, but today I found out he's getting married.",
    "story": "For as long as I [17 F] can remember, I've been in love with my best friend's [17 M] older brother (i will call him T). T [24 M] has always been there—kind, reliable, and everything I looked up to. I thought maybe, just maybe, one day he'd look at me differently, as more than the little girl who tagged along with the boys. He's always been out of reach, but the hope that one day things could change kept me going. Today, I found out that hope is gone. He's getting married. I guess I always knew it was a fantasy, but hearing the news crushed me. It's this strange, deep ache in my chest that I can't shake. I should be happy for him, right? He deserves someone amazing, and I want him to be happy. But I can't help feeling so small and foolish for holding onto something that was never real. I know I'll be okay. I have amazing friends who support me, and a part of me knows this was the push I needed to move on. But right now, it just hurts and I don't know what to do next. How do you stop loving someone when your heart won't listen? How do you let go of something you've held onto for so long?"
  },
  {
    "title": "The only part of the day i look forward to is being in my bed",
    "long_title": "The only part of the day i look forward to is being in my bed",
    "story": "I don't know if this counts as a confession. I'm confessing something, anyway. There is just no joy in my life. I feel this dullness most of the time, apart from the times when I'm really upset, when I just feel so sad and distressed because noting ever gets better. I'm basically OK; I've been getting by for years, but that's all I do: get by. don't know how to enjoy things, or find things that I enjoy. getting into bed at the end of the day is the time where feel least guilty.I spend most of my free time in bed. to be honest. but at night i don't feel guilt about it. I really don't know what to do about this? I'm 17F, I Have no friends - I truly do not Know what it Is like to experience having friends. I would love some, and I don't think I'm a completely terrible person, but for some reason it just never happens for me. I'm trying to make several changes in mv life - like starting at a new college or job, for instance - but it doesn't change how I'm feeling. I don't feel a whole lot. most of the time I'm not sad, just empty. the thing that keeps me going right now is writing a book. I don't know why I'm writing this book, but I've been writing all my life, so it's something to do. I think I just needed to set myself a goal, something to aspire towards so everything's not so flat. it's kind of serves as an excuse for putting myself through this misery, if that makes any sense."
  },
  {
    "title": "I am a male gynecologist",
    "long_title": "I am a male gynecologist",
    "story": "As a male (M 53) gynecologist, I am often asked if I ever get excited during am exam. First, let me say that I did not go into this field because I'm obsessed with the female anatomy (although, admittedly like most men, I am). I just showed an aptitude for this specialty early on. Second, I am proudly and profoundly professional. Plus, I am hardly ever alone while conducting an exam. Okay, while all that is true, I have to admit that, yes, I do get turned on by certain patients. Most women just want to get out of there as quickly as possible (can't blame them). But some seem excited and almost eager. They move or adjust to meet my touch or instruments. They make a sound or breathe a certain way that lets me know they're enjoying themselves. They're cleanly trimmed, shaved or waxed - or very purposely not. I am certain that i've induced orgasm with my fingers and instruments. When this happens I never say anything or acknowledge it in any way. I wish I could though. I wish I could read their minds."
  },
  {
    "title": "I shit my pants during job interview last week",
    "long_title": "I shit my pants during job interview last week",
    "story": "I know this sounds absurd but exactly what the title reads. I had a job interview last week and I shit my pants during it. I do not know what messed up my stomach but just before the interview I felt that burning urge of going to toilet. I felt something was wrong but hoped I could sort it out in 10 mins. Boy, I was wrong. I literally shit my bowels out but still felt like doing more. I checked my phone and it was time for the interview. I did not want to delay it as it was the final round with the COO of the company. I joined the interview call after cleaning myself. We started the interview and I could hear roaring noises coming from my bowels and was sweating. I wished for interview to end quickly but COO asked and asked. In the end, I could not hold it up anymore and literally shit my pants. COO told me I am a great fit for the position and I got the final offer. 3x annual salary of what I previously made with great benefits. I did not know if I should cry or laugh at that time. I just left the call after final sayings. I had to throw my chair out and get a new one. It was a shitty interview but with a great ending. I'll probably tell this one to my grandchildren in the future."
  },
  {
    "title": "My son called me dad in front of his friends",
    "long_title": "My son called me dad in front of his friends",
    "story": "I have been with my wife for 4 years. She has a 12 year old son from a previous relationship. He has never hated me, but it's clear he misses his dad. He's mainly just called me by my name. I don't necessarily like it but I would never force him to call me dad. Today he wanted to go with his friends to an amusement park and he asked me to come with them which already made me happy so of course I said yes. But when his friends got in the car, there was one of them who I've never met before, and he introduced me as his dad. I started smiling when he said that and I think he noticed, because he looked me and rolled his eyes while laughing. Right now they're trying to win a big prize at the park and i'm still smiling I know this isn't something huge or anything, but this is genuinely one of the happiest days I've had in a while."
  },
  {
    "title": "My husband peed on my wedding dress the night of our wedding",
    "long_title": "My husband peed on my wedding dress the night of our wedding",
    "story": "I still have no idea wtf is going on in his head to think that this was \"nothing\" or \"no big deal\", He literally peed on my wedding dress the night of our wedding, INSIDE the hotel room. I yelled at him WTF constantly and he nonchantly said that he was just \"marking his territory\". He went on about how he's been wanting to do this when he gets married and that he didn't tell me because he was positively 100% sure I'd get mad at him but he said it's worth it since he got to do it. I couldn't believe it but he assured me that pee washes off easily and I shouldn't worry but I was just so mad and disgusted by what he's done. He acted like nothing happened and was actually expecting se× but I told him off. I just can't get rid of the awful feeling and sight, I couldn't even sleep in the bed with him after that."
  },
  {
    "title": "I found my fiance's journal and discovered a past that's haunting me",
    "long_title": "I found my fiance's journal and discovered a past that's haunting me",
    "story": "I'm [27 F], and I love my fiancé, who is [28 M]. We've been together for a while now, and things have felt perfect—until recently. He has this journal that he keeps hidden away. I've asked him about it a few times, but he always brushes me off, saying it's nothing and snatches it back. It felt so strange that he wouldn't let me see it, especially since we share everything else. Last weekend, he was away for the day, and I couldn't resist searching for it. After four long hours, I finally found it hidden at the back of his closet. My heart raced as I opened it, expecting to find sweet notes about our relationship. The journal was filled with entries about me, but as I flipped through the pages, I found entries dating back three years—entries about another girl I'd never heard of. He wrote about their devastating breakup and poured his heart into letters directed to her, almost as if he was speaking to her directly. As I went back further, I found elaborate plans for a proposal, dreams of a marriage with her, and so much more.  feeling of betrayal and confusion. He's been planning a future with me, but what about this other girl? I don't know if I can confront him without it blowing up in my face. I love him, but now I'm questioning everything. What do I even do with this information? Should I confront him, or should I just let it go?"
  },
  {
    "title": "My roommates obession is driving me insane",
    "long_title": "My roommates obsession is driving me insane",
    "story": "I'm [22 M] living with my roommate, who is [23 M], and I thought it would be a chill arrangement to save money and live close to my grad school. At first, his constant talk about porn seemed like just a funny joke, but now it's becoming unbearable. It feels like that's all he ever talks about. Every time I start a conversation, he's either talking about the video he watched last night or making some cringeworthy sex joke. I get it; we're young, and guys joke around, but this is on another level. He even made a tier list of porn stars and has their posters taped to the wall. I mean, come on! It's like living in a frat house but without any of the fun. I tried talking to him about it, hoping he would tone it down, but he just laughs it off. It's so frustrating because I can't even have a normal conversation without it turning into a sex joke. I'm starting to feel like I can't even bring friends over because I'm embarrassed. I'm honestly considering looking for a new place. I don't want to be a jerk, but I also can't live in a house that feels like a never-ending adult film set. What should I do?"
  },
  {
    "title": "I hate homeless people",
    "long_title": "I hate homeless people",
    "story": "I'm [34 M], and I used to feel pity for homeless people. I tried to help them when I could, but now I'm just fucking annoyed. I see perfectly able-bodied individuals who refuse to use their bodies to work. They'll ask for money for “food,” but when I offer them a sandwich or something instead of cash, they flip out and hurl cuss words at me like I'm the problem. It's disgusting to walk down the sidewalk with the smell of urine and feces lingering everywhere. It's a health hazard, and it's embarrassing for the community. Just the other day, I offered a guy who lived across the street $100 to mow my lawn. He did a terrible job, leaving half the lawn unmowed and creating this ugly pattern. Then, instead of leaving, he just lay down and slept on my lawn. I didn't wake him up because I thought he needed a break, but the next morning, he was gone, and my lawn was still a mess. To top it off, he left all his stuff scattered everywhere—his blanket, his cart, clothes. I get that life is hard for them, but it feels like they don't even try. I don't know what changed, but I'm just tired of the chaos. I want to help, but I'm starting to think it's a lost cause."
  },
  {
    "title": "What Are Students Even Learning in Grad School",
    "long_title": "What Are Students Even Learning in Grad School",
    "story": "I don't get it. I [25 M] did my undergrad, joined a company, and after two years, I decided to go to grad school because I heard it could really boost my pay. I have an 80% tuition waiver, so it seemed like the perfect time. But honestly, what are my classmates even learning? The professors are teaching valuable stuff, but no one seems to care. It's like everyone's just here to collect a degree without actually engaging. Almost everyone I know uses ChatGPT or some third-party services to do their assignments. Meanwhile, they're either chilling or working part-time jobs just to fund more chilling. Despite this, they still get good grades because they submit their work on time, and most of the courses don't even have exams. I can barely see 2-3 students who are genuinely paying attention in class. I'm starting to wonder if grad school has always been like this. What's the point of the pay gap between graduates and undergraduates if this is the quality of education? It feels like a scam, and I'm questioning whether this was the right move for my career."
  },
  {
    "title": "TIFU by causing a date to have an allergy attack",
    "long_title": "today i fucked up by causing a date to have an allergy attack",
    "story": "I (25M) met a woman (24F) on Tinder and after some time talking, invited her over to my place for some dinner and to play some games of Mario Kart. We added a twist where for each race a person loses, they must remove one article of clothing. What ended up ensuing was multiple competitive rounds, but in the end I won. From there things escalated very quickly and progressed from making out, to both our clothes coming off, eventually reaching the point of us having sex. Here's where the fuck up of the fuck down comes in: In the middle of it things were rough and heavy, and she starts to say her lips are getting itchy, and while this is happening I can see her breasts, thighs, and many other parts start to turn red. We stop and she asks me if the dinner we had, had any sort of seafood in it, and that she has a severe allergy to fish. It was not in the dinner, but in all of that I remember that I had salmon for lunch, and I kissed her in many spots on her body… I tell her what happened, after which she immediately gets dressed back up, grabs her bag and immediately runs to her car and speeds off, presumably I think to go to a hospital. I tried calling and texting her but got no response to both. More than anything I wanted to make sure she was okay, and if it was a bad allergy attack to the point of anaphylaxis I was willing to go with her and drive her to the hospital considering this whole situation was my fault. After 3 days she texts me a short paragraph basically saying i'm a sweet guy but she wasn't feeling a spark. I feel horrible about this and I feel like me causing the allergy attack probably contributed to her decision. TLDR: Had sex with a woman, she had a bad allergy attack because of the fish I ate for lunch, she stopped talking to me a few days later."
  }
]
